name: "Amtrak_Dual"
# Texture data source
layer {
  name: "data_t"
  type: "Data"
  top: "data_t"
  top: "label_t"
  data_param {
    source: "data/amtrak/db_text_train_lmdb"
    source_map: "data/amtrak/split0-images-idx3-ubyte"
    source_map: "data/amtrak/split1-images-idx3-ubyte"
    source_map: "data/amtrak/split2-images-idx3-ubyte"
    source_map: "data/amtrak/split3-images-idx3-ubyte"
    source_map: "data/amtrak/split4-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 128
  }
  transform_param {
    scale: 0.00390625
    crop_size: 75
    mean_value: 96
    mirror: true
    mirror_v: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_t"
  type: "Data"
  top: "data_t"
  top: "label_t"
  data_param {
    source: "data/amtrak/db_text_test_lmdb"
    source_map: "data/amtrak/split0-images-idx3-ubyte"
    source_map: "data/amtrak/split1-images-idx3-ubyte"
    source_map: "data/amtrak/split2-images-idx3-ubyte"
    source_map: "data/amtrak/split3-images-idx3-ubyte"
    source_map: "data/amtrak/split4-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 80
  }
  transform_param {
    scale: 0.00390625
    crop_size: 75
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
# Fasteners data source
layer {
  name: "data_f"
  type: "Data"
  top: "data_f"
  top: "label_f"
  data_param {
    source: "data/amtrak/db_fast_train_lmdb"
    source_map: "data/amtrak/fast0-images-idx3-ubyte"
    source_map: "data/amtrak/fast1-images-idx3-ubyte"
    source_map: "data/amtrak/fast2-images-idx3-ubyte"
    source_map: "data/amtrak/fast3-images-idx3-ubyte"
    source_map: "data/amtrak/fast4-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 16
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_f"
  type: "Data"
  top: "data_f"
  top: "label_f"
  data_param {
    source: "data/amtrak/db_fast_test_lmdb"
    source_map: "data/amtrak/fast0-images-idx3-ubyte"
    source_map: "data/amtrak/fast1-images-idx3-ubyte"
    source_map: "data/amtrak/fast2-images-idx3-ubyte"
    source_map: "data/amtrak/fast3-images-idx3-ubyte"
    source_map: "data/amtrak/fast4-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 20
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
# Texture network
layer {
  name: "conv1_t"
  type: "Convolution"
  bottom: "data_t"
  top: "conv1_t"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_t"
  type: "Pooling"
  bottom: "conv1_t"
  top: "pool1_t"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_t"
  type: "LRN"
  bottom: "pool1_t"
  top: "norm1_t"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_t"
  type: "Convolution"
  bottom: "norm1_t"
  top: "conv2_t"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_t"
  type: "ReLU"
  bottom: "conv2_t"
  top: "conv2_t"
}
layer {
  name: "pool2_t"
  type: "Pooling"
  bottom: "conv2_t"
  top: "pool2_t"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_t"
  type: "Convolution"
  bottom: "pool2_t"
  top: "conv3_t"
  param {
    name: "conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "drop3_t"
  type: "Dropout"
  bottom: "conv3_t"
  top: "conv3_t"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "relu3_t"
  type: "ReLU"
  bottom: "conv3_t"
  top: "conv3_t"
}
layer {
  name: "pool3_t"
  type: "Pooling"
  bottom: "conv3_t"
  top: "pool3_t"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip4_t"
  type: "Convolution"
  bottom: "pool3_t"
  top: "ip4_t"
  param {
    lr_mult: 2
    decay_mult: 2
  }
  param {
    lr_mult: 4
    decay_mult: 0
  }
  convolution_param {
    num_output: 10
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_t"
  type: "Accuracy"
  bottom: "ip4_t"
  bottom: "label_t"
  top: "accuracy_t"
  include: { phase: TEST }
}
layer {
  name: "loss_t"
  type: "SoftmaxWithLoss"
  bottom: "ip4_t"
  bottom: "label_t"
  top: "loss_t"
}
# Fasteners network
layer {
  name: "conv1_f"
  type: "Convolution"
  bottom: "data_f"
  top: "conv1_f"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.5
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_f"
  type: "Pooling"
  bottom: "conv1_f"
  top: "pool1_f"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_f"
  type: "LRN"
  bottom: "pool1_f"
  top: "norm1_f"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_f"
  type: "Convolution"
  bottom: "norm1_f"
  top: "conv2_f"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.5
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_f"
  type: "ReLU"
  bottom: "conv2_f"
  top: "conv2_f"
}
layer {
  name: "pool2_f"
  type: "Pooling"
  bottom: "conv2_f"
  top: "pool2_f"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_f"
  type: "Convolution"
  bottom: "pool2_f"
  top: "conv3_f"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.5
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.5
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_f"
  type: "ReLU"
  bottom: "conv3_f"
  top: "conv3_f"
}
layer {
  name: "drop3_f"
  type: "Dropout"
  bottom: "conv3_f"
  top: "conv3_f"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_f"
  type: "Pooling"
  bottom: "conv3_f"
  top: "pool3_f"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_f"
  type: "Convolution"
  bottom: "pool3_f"
  top: "conv4_f"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_f"
  type: "ReLU"
  bottom: "conv4_f"
  top: "conv4_f"
}
layer {
  name: "drop4_f"
  type: "Dropout"
  bottom: "conv4_f"
  top: "conv4_f"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_f"
  type: "Pooling"
  bottom: "conv4_f"
  top: "pool4_f"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_f"
  type: "Convolution"
  bottom: "pool4_f"
  top: "ip5_f"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 6
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_f"
  type: "Accuracy"
  bottom: "ip5_f"
  bottom: "label_f"
  top: "accuracy_f"
  include: { phase: TEST }
}
layer {
  name: "loss_f"
  type: "SoftmaxWithLoss"
  bottom: "ip5_f"
  bottom: "label_f"
  top: "loss_f"
}
# Task fastVsBg, class 00
layer {
  name: "data_fastVsBg_00"
  type: "Data"
  top: "data_fastVsBg_00"
  top: "label_fastVsBg_00"
  data_param {
    source: "data/amtrak/db_fastVsBg_00_train"
    source_map: "data/amtrak/fastVsBg_0_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_00-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_00"
  type: "Data"
  top: "data_fastVsBg_00"
  top: "label_fastVsBg_00"
  data_param {
    source: "data/amtrak/db_fastVsBg_00_test"
    source_map: "data/amtrak/fastVsBg_0_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_00-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_00-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_00"
  type: "Convolution"
  bottom: "data_fastVsBg_00"
  top: "conv1_fastVsBg_00"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_00"
  type: "Pooling"
  bottom: "conv1_fastVsBg_00"
  top: "pool1_fastVsBg_00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_00"
  type: "LRN"
  bottom: "pool1_fastVsBg_00"
  top: "norm1_fastVsBg_00"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_00"
  type: "Convolution"
  bottom: "norm1_fastVsBg_00"
  top: "conv2_fastVsBg_00"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_00"
  type: "ReLU"
  bottom: "conv2_fastVsBg_00"
  top: "conv2_fastVsBg_00"
}
layer {
  name: "pool2_fastVsBg_00"
  type: "Pooling"
  bottom: "conv2_fastVsBg_00"
  top: "pool2_fastVsBg_00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_00"
  type: "Convolution"
  bottom: "pool2_fastVsBg_00"
  top: "conv3_fastVsBg_00"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_00"
  type: "ReLU"
  bottom: "conv3_fastVsBg_00"
  top: "conv3_fastVsBg_00"
}
layer {
  name: "drop3_fastVsBg_00"
  type: "Dropout"
  bottom: "conv3_fastVsBg_00"
  top: "conv3_fastVsBg_00"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_00"
  type: "Pooling"
  bottom: "conv3_fastVsBg_00"
  top: "pool3_fastVsBg_00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_00"
  type: "Convolution"
  bottom: "pool3_fastVsBg_00"
  top: "conv4_fastVsBg_00"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_00"
  type: "ReLU"
  bottom: "conv4_fastVsBg_00"
  top: "conv4_fastVsBg_00"
}
layer {
  name: "drop4_fastVsBg_00"
  type: "Dropout"
  bottom: "conv4_fastVsBg_00"
  top: "conv4_fastVsBg_00"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_00"
  type: "Pooling"
  bottom: "conv4_fastVsBg_00"
  top: "pool4_fastVsBg_00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_00"
  type: "Convolution"
  bottom: "pool4_fastVsBg_00"
  top: "ip5_fastVsBg_00"
  param {
    name: "ip5_fastVsBg_00_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_00_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_00"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_00"
  bottom: "label_fastVsBg_00"
  top: "accuracy_fastVsBg_00"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_00"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_00"
  bottom: "label_fastVsBg_00"
#  top: "loss_fastVsBg_00"
}

# Task fastVsBg, class 01
layer {
  name: "data_fastVsBg_01"
  type: "Data"
  top: "data_fastVsBg_01"
  top: "label_fastVsBg_01"
  data_param {
    source: "data/amtrak/db_fastVsBg_01_train"
    source_map: "data/amtrak/fastVsBg_0_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_01-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_01"
  type: "Data"
  top: "data_fastVsBg_01"
  top: "label_fastVsBg_01"
  data_param {
    source: "data/amtrak/db_fastVsBg_01_test"
    source_map: "data/amtrak/fastVsBg_0_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_01-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_01-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_01"
  type: "Convolution"
  bottom: "data_fastVsBg_01"
  top: "conv1_fastVsBg_01"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_01"
  type: "Pooling"
  bottom: "conv1_fastVsBg_01"
  top: "pool1_fastVsBg_01"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_01"
  type: "LRN"
  bottom: "pool1_fastVsBg_01"
  top: "norm1_fastVsBg_01"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_01"
  type: "Convolution"
  bottom: "norm1_fastVsBg_01"
  top: "conv2_fastVsBg_01"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_01"
  type: "ReLU"
  bottom: "conv2_fastVsBg_01"
  top: "conv2_fastVsBg_01"
}
layer {
  name: "pool2_fastVsBg_01"
  type: "Pooling"
  bottom: "conv2_fastVsBg_01"
  top: "pool2_fastVsBg_01"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_01"
  type: "Convolution"
  bottom: "pool2_fastVsBg_01"
  top: "conv3_fastVsBg_01"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_01"
  type: "ReLU"
  bottom: "conv3_fastVsBg_01"
  top: "conv3_fastVsBg_01"
}
layer {
  name: "drop3_fastVsBg_01"
  type: "Dropout"
  bottom: "conv3_fastVsBg_01"
  top: "conv3_fastVsBg_01"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_01"
  type: "Pooling"
  bottom: "conv3_fastVsBg_01"
  top: "pool3_fastVsBg_01"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_01"
  type: "Convolution"
  bottom: "pool3_fastVsBg_01"
  top: "conv4_fastVsBg_01"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_01"
  type: "ReLU"
  bottom: "conv4_fastVsBg_01"
  top: "conv4_fastVsBg_01"
}
layer {
  name: "drop4_fastVsBg_01"
  type: "Dropout"
  bottom: "conv4_fastVsBg_01"
  top: "conv4_fastVsBg_01"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_01"
  type: "Pooling"
  bottom: "conv4_fastVsBg_01"
  top: "pool4_fastVsBg_01"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_01"
  type: "Convolution"
  bottom: "pool4_fastVsBg_01"
  top: "ip5_fastVsBg_01"
  param {
    name: "ip5_fastVsBg_01_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_01_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_01"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_01"
  bottom: "label_fastVsBg_01"
  top: "accuracy_fastVsBg_01"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_01"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_01"
  bottom: "label_fastVsBg_01"
#  top: "loss_fastVsBg_01"
}

# Task fastVsBg, class 02
layer {
  name: "data_fastVsBg_02"
  type: "Data"
  top: "data_fastVsBg_02"
  top: "label_fastVsBg_02"
  data_param {
    source: "data/amtrak/db_fastVsBg_02_train"
    source_map: "data/amtrak/fastVsBg_0_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_02-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_02"
  type: "Data"
  top: "data_fastVsBg_02"
  top: "label_fastVsBg_02"
  data_param {
    source: "data/amtrak/db_fastVsBg_02_test"
    source_map: "data/amtrak/fastVsBg_0_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_02-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_02-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_02"
  type: "Convolution"
  bottom: "data_fastVsBg_02"
  top: "conv1_fastVsBg_02"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_02"
  type: "Pooling"
  bottom: "conv1_fastVsBg_02"
  top: "pool1_fastVsBg_02"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_02"
  type: "LRN"
  bottom: "pool1_fastVsBg_02"
  top: "norm1_fastVsBg_02"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_02"
  type: "Convolution"
  bottom: "norm1_fastVsBg_02"
  top: "conv2_fastVsBg_02"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_02"
  type: "ReLU"
  bottom: "conv2_fastVsBg_02"
  top: "conv2_fastVsBg_02"
}
layer {
  name: "pool2_fastVsBg_02"
  type: "Pooling"
  bottom: "conv2_fastVsBg_02"
  top: "pool2_fastVsBg_02"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_02"
  type: "Convolution"
  bottom: "pool2_fastVsBg_02"
  top: "conv3_fastVsBg_02"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_02"
  type: "ReLU"
  bottom: "conv3_fastVsBg_02"
  top: "conv3_fastVsBg_02"
}
layer {
  name: "drop3_fastVsBg_02"
  type: "Dropout"
  bottom: "conv3_fastVsBg_02"
  top: "conv3_fastVsBg_02"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_02"
  type: "Pooling"
  bottom: "conv3_fastVsBg_02"
  top: "pool3_fastVsBg_02"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_02"
  type: "Convolution"
  bottom: "pool3_fastVsBg_02"
  top: "conv4_fastVsBg_02"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_02"
  type: "ReLU"
  bottom: "conv4_fastVsBg_02"
  top: "conv4_fastVsBg_02"
}
layer {
  name: "drop4_fastVsBg_02"
  type: "Dropout"
  bottom: "conv4_fastVsBg_02"
  top: "conv4_fastVsBg_02"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_02"
  type: "Pooling"
  bottom: "conv4_fastVsBg_02"
  top: "pool4_fastVsBg_02"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_02"
  type: "Convolution"
  bottom: "pool4_fastVsBg_02"
  top: "ip5_fastVsBg_02"
  param {
    name: "ip5_fastVsBg_02_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_02_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_02"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_02"
  bottom: "label_fastVsBg_02"
  top: "accuracy_fastVsBg_02"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_02"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_02"
  bottom: "label_fastVsBg_02"
#  top: "loss_fastVsBg_02"
}

# Task fastVsBg, class 03
layer {
  name: "data_fastVsBg_03"
  type: "Data"
  top: "data_fastVsBg_03"
  top: "label_fastVsBg_03"
  data_param {
    source: "data/amtrak/db_fastVsBg_03_train"
    source_map: "data/amtrak/fastVsBg_0_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_03-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_03"
  type: "Data"
  top: "data_fastVsBg_03"
  top: "label_fastVsBg_03"
  data_param {
    source: "data/amtrak/db_fastVsBg_03_test"
    source_map: "data/amtrak/fastVsBg_0_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_03-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_03-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_03"
  type: "Convolution"
  bottom: "data_fastVsBg_03"
  top: "conv1_fastVsBg_03"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_03"
  type: "Pooling"
  bottom: "conv1_fastVsBg_03"
  top: "pool1_fastVsBg_03"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_03"
  type: "LRN"
  bottom: "pool1_fastVsBg_03"
  top: "norm1_fastVsBg_03"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_03"
  type: "Convolution"
  bottom: "norm1_fastVsBg_03"
  top: "conv2_fastVsBg_03"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_03"
  type: "ReLU"
  bottom: "conv2_fastVsBg_03"
  top: "conv2_fastVsBg_03"
}
layer {
  name: "pool2_fastVsBg_03"
  type: "Pooling"
  bottom: "conv2_fastVsBg_03"
  top: "pool2_fastVsBg_03"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_03"
  type: "Convolution"
  bottom: "pool2_fastVsBg_03"
  top: "conv3_fastVsBg_03"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_03"
  type: "ReLU"
  bottom: "conv3_fastVsBg_03"
  top: "conv3_fastVsBg_03"
}
layer {
  name: "drop3_fastVsBg_03"
  type: "Dropout"
  bottom: "conv3_fastVsBg_03"
  top: "conv3_fastVsBg_03"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_03"
  type: "Pooling"
  bottom: "conv3_fastVsBg_03"
  top: "pool3_fastVsBg_03"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_03"
  type: "Convolution"
  bottom: "pool3_fastVsBg_03"
  top: "conv4_fastVsBg_03"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_03"
  type: "ReLU"
  bottom: "conv4_fastVsBg_03"
  top: "conv4_fastVsBg_03"
}
layer {
  name: "drop4_fastVsBg_03"
  type: "Dropout"
  bottom: "conv4_fastVsBg_03"
  top: "conv4_fastVsBg_03"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_03"
  type: "Pooling"
  bottom: "conv4_fastVsBg_03"
  top: "pool4_fastVsBg_03"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_03"
  type: "Convolution"
  bottom: "pool4_fastVsBg_03"
  top: "ip5_fastVsBg_03"
  param {
    name: "ip5_fastVsBg_03_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_03_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_03"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_03"
  bottom: "label_fastVsBg_03"
  top: "accuracy_fastVsBg_03"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_03"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_03"
  bottom: "label_fastVsBg_03"
#  top: "loss_fastVsBg_03"
}

# Task fastVsBg, class 04
layer {
  name: "data_fastVsBg_04"
  type: "Data"
  top: "data_fastVsBg_04"
  top: "label_fastVsBg_04"
  data_param {
    source: "data/amtrak/db_fastVsBg_04_train"
    source_map: "data/amtrak/fastVsBg_0_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_04-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_04"
  type: "Data"
  top: "data_fastVsBg_04"
  top: "label_fastVsBg_04"
  data_param {
    source: "data/amtrak/db_fastVsBg_04_test"
    source_map: "data/amtrak/fastVsBg_0_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_04-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_04-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_04"
  type: "Convolution"
  bottom: "data_fastVsBg_04"
  top: "conv1_fastVsBg_04"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_04"
  type: "Pooling"
  bottom: "conv1_fastVsBg_04"
  top: "pool1_fastVsBg_04"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_04"
  type: "LRN"
  bottom: "pool1_fastVsBg_04"
  top: "norm1_fastVsBg_04"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_04"
  type: "Convolution"
  bottom: "norm1_fastVsBg_04"
  top: "conv2_fastVsBg_04"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_04"
  type: "ReLU"
  bottom: "conv2_fastVsBg_04"
  top: "conv2_fastVsBg_04"
}
layer {
  name: "pool2_fastVsBg_04"
  type: "Pooling"
  bottom: "conv2_fastVsBg_04"
  top: "pool2_fastVsBg_04"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_04"
  type: "Convolution"
  bottom: "pool2_fastVsBg_04"
  top: "conv3_fastVsBg_04"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_04"
  type: "ReLU"
  bottom: "conv3_fastVsBg_04"
  top: "conv3_fastVsBg_04"
}
layer {
  name: "drop3_fastVsBg_04"
  type: "Dropout"
  bottom: "conv3_fastVsBg_04"
  top: "conv3_fastVsBg_04"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_04"
  type: "Pooling"
  bottom: "conv3_fastVsBg_04"
  top: "pool3_fastVsBg_04"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_04"
  type: "Convolution"
  bottom: "pool3_fastVsBg_04"
  top: "conv4_fastVsBg_04"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_04"
  type: "ReLU"
  bottom: "conv4_fastVsBg_04"
  top: "conv4_fastVsBg_04"
}
layer {
  name: "drop4_fastVsBg_04"
  type: "Dropout"
  bottom: "conv4_fastVsBg_04"
  top: "conv4_fastVsBg_04"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_04"
  type: "Pooling"
  bottom: "conv4_fastVsBg_04"
  top: "pool4_fastVsBg_04"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_04"
  type: "Convolution"
  bottom: "pool4_fastVsBg_04"
  top: "ip5_fastVsBg_04"
  param {
    name: "ip5_fastVsBg_04_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_04_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_04"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_04"
  bottom: "label_fastVsBg_04"
  top: "accuracy_fastVsBg_04"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_04"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_04"
  bottom: "label_fastVsBg_04"
#  top: "loss_fastVsBg_04"
}

# Task fastVsBg, class 05
layer {
  name: "data_fastVsBg_05"
  type: "Data"
  top: "data_fastVsBg_05"
  top: "label_fastVsBg_05"
  data_param {
    source: "data/amtrak/db_fastVsBg_05_train"
    source_map: "data/amtrak/fastVsBg_0_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_05-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_05"
  type: "Data"
  top: "data_fastVsBg_05"
  top: "label_fastVsBg_05"
  data_param {
    source: "data/amtrak/db_fastVsBg_05_test"
    source_map: "data/amtrak/fastVsBg_0_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_05-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_05-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_05"
  type: "Convolution"
  bottom: "data_fastVsBg_05"
  top: "conv1_fastVsBg_05"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_05"
  type: "Pooling"
  bottom: "conv1_fastVsBg_05"
  top: "pool1_fastVsBg_05"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_05"
  type: "LRN"
  bottom: "pool1_fastVsBg_05"
  top: "norm1_fastVsBg_05"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_05"
  type: "Convolution"
  bottom: "norm1_fastVsBg_05"
  top: "conv2_fastVsBg_05"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_05"
  type: "ReLU"
  bottom: "conv2_fastVsBg_05"
  top: "conv2_fastVsBg_05"
}
layer {
  name: "pool2_fastVsBg_05"
  type: "Pooling"
  bottom: "conv2_fastVsBg_05"
  top: "pool2_fastVsBg_05"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_05"
  type: "Convolution"
  bottom: "pool2_fastVsBg_05"
  top: "conv3_fastVsBg_05"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_05"
  type: "ReLU"
  bottom: "conv3_fastVsBg_05"
  top: "conv3_fastVsBg_05"
}
layer {
  name: "drop3_fastVsBg_05"
  type: "Dropout"
  bottom: "conv3_fastVsBg_05"
  top: "conv3_fastVsBg_05"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_05"
  type: "Pooling"
  bottom: "conv3_fastVsBg_05"
  top: "pool3_fastVsBg_05"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_05"
  type: "Convolution"
  bottom: "pool3_fastVsBg_05"
  top: "conv4_fastVsBg_05"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_05"
  type: "ReLU"
  bottom: "conv4_fastVsBg_05"
  top: "conv4_fastVsBg_05"
}
layer {
  name: "drop4_fastVsBg_05"
  type: "Dropout"
  bottom: "conv4_fastVsBg_05"
  top: "conv4_fastVsBg_05"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_05"
  type: "Pooling"
  bottom: "conv4_fastVsBg_05"
  top: "pool4_fastVsBg_05"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_05"
  type: "Convolution"
  bottom: "pool4_fastVsBg_05"
  top: "ip5_fastVsBg_05"
  param {
    name: "ip5_fastVsBg_05_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_05_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_05"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_05"
  bottom: "label_fastVsBg_05"
  top: "accuracy_fastVsBg_05"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_05"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_05"
  bottom: "label_fastVsBg_05"
#  top: "loss_fastVsBg_05"
}

# Task fastVsBg, class 06
layer {
  name: "data_fastVsBg_06"
  type: "Data"
  top: "data_fastVsBg_06"
  top: "label_fastVsBg_06"
  data_param {
    source: "data/amtrak/db_fastVsBg_06_train"
    source_map: "data/amtrak/fastVsBg_0_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_06-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_06"
  type: "Data"
  top: "data_fastVsBg_06"
  top: "label_fastVsBg_06"
  data_param {
    source: "data/amtrak/db_fastVsBg_06_test"
    source_map: "data/amtrak/fastVsBg_0_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_06-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_06-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 2
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "conv1_fastVsBg_06"
  type: "Convolution"
  bottom: "data_fastVsBg_06"
  top: "conv1_fastVsBg_06"
  param {
    name: "conv1_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1_fastVsBg_06"
  type: "Pooling"
  bottom: "conv1_fastVsBg_06"
  top: "pool1_fastVsBg_06"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_fastVsBg_06"
  type: "LRN"
  bottom: "pool1_fastVsBg_06"
  top: "norm1_fastVsBg_06"
  lrn_param {
    local_size: 5
    alpha: 0.001
    beta: 0.5
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv2_fastVsBg_06"
  type: "Convolution"
  bottom: "norm1_fastVsBg_06"
  top: "conv2_fastVsBg_06"
  param {
    name: "conv2_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_fastVsBg_06"
  type: "ReLU"
  bottom: "conv2_fastVsBg_06"
  top: "conv2_fastVsBg_06"
}
layer {
  name: "pool2_fastVsBg_06"
  type: "Pooling"
  bottom: "conv2_fastVsBg_06"
  top: "pool2_fastVsBg_06"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_fastVsBg_06"
  type: "Convolution"
  bottom: "pool2_fastVsBg_06"
  top: "conv3_fastVsBg_06"
  param {
    name: "conv3_w"
    lr_mult: 1
    lr_pre_mult: 0.01
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    lr_pre_mult: 0.01
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_fastVsBg_06"
  type: "ReLU"
  bottom: "conv3_fastVsBg_06"
  top: "conv3_fastVsBg_06"
}
layer {
  name: "drop3_fastVsBg_06"
  type: "Dropout"
  bottom: "conv3_fastVsBg_06"
  top: "conv3_fastVsBg_06"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "pool3_fastVsBg_06"
  type: "Pooling"
  bottom: "conv3_fastVsBg_06"
  top: "pool3_fastVsBg_06"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_fastVsBg_06"
  type: "Convolution"
  bottom: "pool3_fastVsBg_06"
  top: "conv4_fastVsBg_06"
  propagate_down: false
  param {
    name: "conv4_w"
    lr_mult: 1
    lr_pre_mult: 0.02
    decay_mult: 10
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    lr_pre_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_fastVsBg_06"
  type: "ReLU"
  bottom: "conv4_fastVsBg_06"
  top: "conv4_fastVsBg_06"
}
layer {
  name: "drop4_fastVsBg_06"
  type: "Dropout"
  bottom: "conv4_fastVsBg_06"
  top: "conv4_fastVsBg_06"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "pool4_fastVsBg_06"
  type: "Pooling"
  bottom: "conv4_fastVsBg_06"
  top: "pool4_fastVsBg_06"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip5_fastVsBg_06"
  type: "Convolution"
  bottom: "pool4_fastVsBg_06"
  top: "ip5_fastVsBg_06"
  param {
    name: "ip5_fastVsBg_06_w"
    lr_mult: 0.1
    decay_mult: 1000
  }
  param {
    name: "ip5_fastVsBg_06_b"
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy_fastVsBg_06"
  type: "Accuracy"
  bottom: "ip5_fastVsBg_06"
  bottom: "label_fastVsBg_06"
  top: "accuracy_fastVsBg_06"
  include: { phase: TEST }
}
layer {
  name: "loss_fastVsBg_06"
  type: "HingeLoss"
  bottom: "ip5_fastVsBg_06"
  bottom: "label_fastVsBg_06"
#  top: "loss_fastVsBg_06"
}

# Task fastVsBg, class 07
layer {
  name: "data_fastVsBg_07"
  type: "Data"
  top: "data_fastVsBg_07"
  top: "label_fastVsBg_07"
  data_param {
    source: "data/amtrak/db_fastVsBg_07_train"
    source_map: "data/amtrak/fastVsBg_0_07-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_07-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_07-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_3_07-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_4_07-images-idx3-ubyte"
    backend: LMDB_FILE
    batch_size: 1
  }
  transform_param {
    scale: 0.00390625
    crop_size: 182
    mean_value: 96
    mirror: false
    mirror_v: false
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_fastVsBg_07"
  type: "Data"
  top: "data_fastVsBg_07"
  top: "label_fastVsBg_07"
  data_param {
    source: "data/amtrak/db_fastVsBg_07_test"
    source_map: "data/amtrak/fastVsBg_0_07-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_1_07-images-idx3-ubyte"
    source_map: "data/amtrak/fastVsBg_2_07-images-idx3-ubyte"
